# SetColumnWidth Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..SetColumnWidth Method
TableSectionData Class See Also
---
Sets a column's width in feet
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetColumnWidth(
	int nCol,
	double width
)
```

Visual Basic
---
```text
Public Sub SetColumnWidth ( _
	nCol As Integer, _
	width As Double _
)
```

Visual C++
---
```text
public:
void SetColumnWidth(
	int nCol,
	double width
)
```

# ### Parameters
nCol
    Type: System..::..Int32
width
    Type: System..::..Double
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. -or- The column width is outside of acceptable range. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace